OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
/**************************************************************************//**
 * @file     i3c.c
 * @version  V1.00
 * @brief    I3C driver source file
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2023 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/

#include "NuMicro.h"

/** @cond HIDDEN_SYMBOLS */
void _I3C_DrvMsg(const char *format, ...);

void _I3C_DrvMsg(const char *format, ...)
{
    (void)format;
}

#ifndef I3C_DrvMsg
    #define I3C_DrvMsg _I3C_DrvMsg
#endif
/** @endcond HIDDEN_SYMBOLS */


/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup I3C_Driver I3C Driver
  @{
*/

/** @addtogroup I3C_EXPORTED_FUNCTIONS I3C Exported Functions
  @{
*/


/**
  * @brief  Initial I3C Device Type
  */
int32_t I3C_DeviceInit(I3C_DEVICE_T *dev)
{
    /* Response buffer threshold */
    dev->port->QUETHCTL  = (0UL << I3C_QUETHCTL_RESPTH_Pos);
    /* Command buffer empty threshold */
    dev->port->QUETHCTL |= (1UL << I3C_QUETHCTL_CMDETH_Pos);
    /* IBI data segment size to 2-words(8-bytes) */
    dev->port->QUETHCTL |= (2UL << I3C_QUETHCTL_IBIDATTH_Pos);
    /* Rx receive and Tx empty threshold */
    dev->port->DBTHCTL  = ((0UL << I3C_DBTHCTL_TXTH_Pos) | (0UL << I3C_DBTHCTL_RXTH_Pos));
    /* Rx and Tx start threshold */
    dev->port->DBTHCTL |= ((0UL << I3C_DBTHCTL_TXSTATH_Pos) | (0UL << I3C_DBTHCTL_RXSTATH_Pos));
    /* Clear all interrupt status */
    dev->port->INTSTS = ~0UL;
    /* Enable all interrupt status */
    dev->port->INTSTSEN = ~0UL;
    /* Enable specified interrupt signal */
    dev->port->INTEN = (I3C_INTEN_RESPRDY_Msk  | I3C_INTEN_CCCUPD_Msk   | I3C_INTEN_DAA_Msk |
                        I3C_INTEN_TFRERR_Msk   | I3C_INTEN_READREQ_Msk  | I3C_INTEN_TFRABORT_Msk |
                        I3C_INTEN_IBIUPD_Msk   | I3C_INTEN_DEFTGTS_Msk  | I3C_INTEN_BUSOWNER_Msk |
                        I3C_INTEN_BUSRSTDN_Msk | I3C_INTEN_IBITH_Msk);

    /* Configure related bus timings, SCL clock */
    if (dev->engclk == 0UL)
    {
        return I3C_STS_INVALID_INPUT;
    }

    I3C_BusClkConfig(dev);

    if (dev->device_role == I3C_CONTROLLER)
    {
        /* Program Dynamic Address for Controller */
        dev->port->DEVADDR = (I3C_DEVADDR_DAVALID_Msk | (dev->main_controller_da << I3C_DEVADDR_DA_Pos));
        /* Set as Controller role */
        dev->port->DEVCTLE = dev->device_role;
        /* Set Conroller includes I3C Broadcast Address */
        dev->port->DEVCTL |= (I3C_DEVCTL_ENABLE_Msk | I3C_DEVCTL_IBAINCL_Msk);
        /* Enable device */
        dev->port->DEVCTL |= I3C_DEVCTL_ENABLE_Msk;
        /* Enable GETMXDS CCC response */
        dev->port->SLVCHAR |= I3C_SLVCHAR_MXDSLIM_Msk;
    }
    else if (dev->device_role == I3C_TARGET)
    {
        /* Set as Target role */
        dev->port->DEVCTLE = dev->device_role;
        /* Includes I3C Broadcast Address */
        dev->port->DEVCTL |= (I3C_DEVCTL_IBAINCL_Msk);

        if (dev->main_target_sa != 0U)
        {
            /* Program Statis Address for Target */
            dev->port->DEVADDR |= (I3C_DEVADDR_SAVALID_Msk | (dev->main_target_sa << I3C_DEVADDR_SA_Pos));
            dev->target_sa[0] = dev->main_target_sa;
        }

        /* Select the Target ability for enter I3C mode */
        if (dev->target_daa_mode == I3C_SUPPORT_ENTDAA)
        {
            /* HJEN disabled: Target supports ENTDAA CCC */
            dev->port->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            dev->port->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;
        }
        else if (dev->target_daa_mode == I3C_SUPPORT_ADAPTIVE_HJ)
        {
            /* Both ADAPTIVE and HJEN enabled: Target generates a Hot-Join request until receive I3C header 7'h7E on the bus */
            dev->port->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            dev->port->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
        }
        else if (dev->target_daa_mode == I3C_SUPPORT_IMMEDIATE_HJ)
        {
            /* Only HJEN enabled: Target generates a Hot-Join request immediately */
            dev->port->DEVCTL &= ~I3C_DEVCTL_ADAPTIVE_Msk;
            dev->port->SLVEVNTS |= I3C_SLVEVNTS_HJEN_Msk;
        }
        else
        {
            /* HJEN disabled: Target supports ENTDAA CCC */
            dev->port->DEVCTL |= I3C_DEVCTL_ADAPTIVE_Msk;
            dev->port->SLVEVNTS &= ~I3C_SLVEVNTS_HJEN_Msk;
        }

        /* Enable GETMXDS CCC response */
        dev->port->SLVCHAR |= I3C_SLVCHAR_MXDSLIM_Msk;
    }
    else
    {
        return I3C_STS_INVALID_INPUT;
    }

    if (dev->device_role == I3C_CONTROLLER)
    {
        if (!(dev->port->DEVCTL & I3C_DEVCTL_ENABLE_Msk))
        {
            return (~I3C_STS_NO_ERR);
        }
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief      Setup I2C / I3C Device Address Table
  *
  * @param[in]  *i3c            Point to I3C peripheral
  * @param[in]  u8DevIndex      the offset of Device Address Table.
  *                             It could be 0 ~ 6 for DEV1ADR to DEV7ADR.
  * @param[in]  u8DevType       the Target device type. It could be I3C_DEVTYPE_I3C for I3C device and I3C_DEVTYPE_I2C for I2C device
  * @param[in]  u8DAddr         7Bits Device Synamic Address
  * @param[in]  u8SAddr         7Bits Device Static Address
  *
  * @retval     I3C_STS_NO_ERR          No error
  * @retval     I3C_STS_INVALID_INPUT   Invalid input parameter
  *
  * @details    The function is used for I3C Controller to setup Device Address Table.
  * @note       Device Address Table must be set before communication with Target Devices.
  *
  */
int32_t I3C_SetDeviceAddr(I3C_T *i3c, uint8_t u8DevIndex, uint8_t u8DevType, uint8_t u8DAddr, uint8_t u8SAddr)
{
    volatile uint32_t i;
    volatile uint32_t count = 0;
    volatile uint32_t u32Device = 0;

    if ((u8DAddr & 0x80U) || (u8SAddr & 0x80U))
    {
        return I3C_STS_INVALID_INPUT;
    }

    // I3C Device Dynamic Address with Odd Parity
    for (i = 0UL; i < 8UL; i++)
    {
        if ((u8DAddr >> i) & 0x1U)
        {
            count ++;
        }
    }

