OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
    if ((count % 2UL) == 0UL)
    {
        u32Device = ((u8DAddr | 0x80UL) << I3C_DEVADR_DADR_Pos);
    }
    else
    {
        u32Device = ((u8DAddr & 0x7FUL) << I3C_DEVADR_DADR_Pos);
    }

    // I2C Device Static Address
    u32Device |= ((u8SAddr & 0x7FUL) << I3C_DEVADR_STADR_Pos);
    // Support IBI with one or more Mandatory Bytes
    u32Device |= (I3C_DEVADR_IBIWDATA_Msk);

    // Device Type
    if (u8DevType != I3C_DEVTYPE_I3C)
    {
        u32Device |= I3C_DEVADR_DEVICE_Msk;
    }

    switch (u8DevIndex)
    {
        case 0U:
        case 1U:
        case 2U:
        case 3U:
        case 4U:
        case 5U:
        case 6U:
            /* Configure device address on specify table location */
            i3c->DEVADR[u8DevIndex] = u32Device;
            break;

        default:
            return I3C_STS_INVALID_INPUT;
            break;
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief  Configure Bus Timing
  */
void I3C_BusClkConfig(I3C_DEVICE_T *dev)
{
    volatile uint32_t count;
    volatile float fcount;
    I3C_DrvMsg("\n");

    if (dev->i2c_fm_freq != 0UL)
    {
        /* SCL freq for I2C FM mode */
        if (dev->i2c_fm_freq > dev->engclk)
        {
            dev->i2c_fm_freq = dev->engclk;
        }

        count = ((dev->engclk / dev->i2c_fm_freq) / 2UL);

        if (count < 5UL)
        {
            count = 5;
        }

        dev->port->SCLFM = ((count << I3C_SCLFM_FMHCNT_Pos) | (count << I3C_SCLFM_FMLCNT_Pos));
    }

    if (dev->i2c_fm_plus_freq != 0UL)
    {
        /* SCL freq for I2C FM+ mode */
        if (dev->i2c_fm_plus_freq > dev->engclk)
        {
            dev->i2c_fm_plus_freq = dev->engclk;
        }

        count = ((dev->engclk / dev->i2c_fm_plus_freq) / 2UL);

        if (count < 5UL)
        {
            count = 5;
        }

        dev->port->SCLFMP = ((count << I3C_SCLFMP_FMPHCNT_Pos) | (count << I3C_SCLFMP_FMPLCNT_Pos));
    }

    if (dev->i3c_sdr_freq != 0UL)
    {
        if (dev->i3c_sdr_freq > 12500000UL)
        {
            dev->i3c_sdr_freq = 12500000UL;
        }

        /* Set OD mode SCL freq 1MHz */
        count = ((dev->engclk / (1000UL * 1000UL)) / 2UL);

        if (count < 5UL)
        {
            count = 5;
        }

        dev->port->SCLOD = ((count << I3C_SCLOD_ODHCNT_Pos) | (count << I3C_SCLOD_ODLCNT_Pos));

        /* Set PP mode SCL freq for SDR0 */
        if (dev->i3c_sdr_freq > dev->engclk)
        {
            dev->i3c_sdr_freq = dev->engclk;
        }

        count = ((dev->engclk / dev->i3c_sdr_freq) / 2UL);

        if (count < 5UL)
        {
            count = 5;
        }

        if ((dev->i3c_sdr_freq == 12500000UL) && ((dev->engclk % dev->i3c_sdr_freq) != 0UL))
        {
            dev->port->SCLPP = ((count + 1UL) << I3C_SCLPP_PPLCNT_Pos);
            dev->port->SCLPP |= ((count + 1UL) << I3C_SCLPP_PPHCNT_Pos);
            dev->i3c_sdr_freq = (dev->engclk / ((count + 1UL) + (count + 1UL)));
        }
        else
        {
            dev->port->SCLPP = ((count << I3C_SCLPP_PPHCNT_Pos) | (count << I3C_SCLPP_PPLCNT_Pos));
            dev->i3c_sdr_freq = (dev->engclk / (count + count));
        }

        I3C_DrvMsg("[ DRV ] Set SCL %d Hz\n", dev->i3c_sdr_freq);
    }

    /*  Bus Idle Timing ~ 200us */
    fcount = ((float)200UL * dev->engclk) / (float)1000000UL;
    count = (uint32_t)fcount;

    if (count == 0UL)
    {
        count = 0x50;
    }

    dev->port->BUSIDLET = count;
    /* Bus Available(1.0us) Timing ~ 1.0us */
    fcount = ((float)1UL * dev->engclk) / (float)1000000UL;
    count = (uint32_t)fcount;

    if (count == 0UL)
    {
        count = 0x50;
    }

    dev->port->BUSFAT = (count << I3C_BUSFAT_AVAILTC_Pos);
    /* Bus Free Timing ~ 38.4ns/0.5us/1.3us */
    fcount = ((float)1300UL * dev->engclk) / (float)1000000000UL;
    count = (uint32_t)fcount;

    if (count == 0UL)
    {
        count = 0x50;
    }

    dev->port->BUSFAT |= (count << I3C_BUSFAT_FREETC_Pos);
    /* I3C Read Termination Bit Low Count */
    dev->port->SCLTERM |= I3C_SCLTERM_EXTERM_Msk;
}

/**
  * @brief  Show Present State Information
  */
void I3C_PresentStateInfo(I3C_DEVICE_T *dev)
{
    volatile uint32_t role;
    volatile uint32_t sts;
    volatile uint32_t reg_val[2];
    I3C_DrvMsg("\n");
    role = ((dev->port->DEVCTLE & I3C_DEVCTLE_OPERMODE_Msk) >> I3C_DEVCTLE_OPERMODE_Pos);
    reg_val[0] = dev->port->PRESENTS;
    reg_val[1] = dev->port->CCCDEVS;
    I3C_DrvMsg("[ DRV ] Present state info: 0x%08x (%s mode)\n", reg_val[0], (role == 0UL) ? "Controller" : "Target");
    sts = ((reg_val[0] & I3C_PRESENTS_TFRTYPE_Msk) >> I3C_PRESENTS_TFRTYPE_Pos);

    if (sts == 0UL)
    {
        I3C_DrvMsg("\tDevice in IDLE state\n");
    }
    else
    {
        if (role == I3C_CONTROLLER)
        {
            if (reg_val[0] & I3C_PRESENTS_MAIDLE_Msk)
            {
                I3C_DrvMsg("\tController is in IDLE State\n");
            }
            else
            {
                I3C_DrvMsg("\tController is NOT in IDLE State\n");
            }

            if (sts == 0xFUL)
            {
                I3C_DrvMsg("\tController in Halt State, waiting for resume\n");
            }
            else
            {
                I3C_DrvMsg("\tController error code: 0x%x\n", sts);
            }
        }
        else
        {
            if (sts == 1UL)
            {
                I3C_DrvMsg("\tHot-Join Transfer State\n");
            }
            else if (sts == 2UL)
            {
                I3C_DrvMsg("\nIBI Transfer State\n");
            }
            else if (sts == 3UL)
            {
                I3C_DrvMsg("\nController Write Transfer Ongoing\n");
            }
            else if (sts == 5UL)
            {
                I3C_DrvMsg("\nController Read Transfer Ongoing\n");
            }
            else if (sts == 6UL)
            {
                I3C_DrvMsg("\nTarget in Halt State, waiting for resume\n");
            }
            else
            {
                I3C_DrvMsg("\nTarget error code: 0x%x\n", sts);
            }
        }
    }

    I3C_DrvMsg("\n");
}

/**
  * @brief  Enable I3C Rx DMA function on PDMA ch-n.
  */
int32_t I3C_ConfigRxDMA(I3C_DEVICE_T *dev, uint32_t u32Src, uint32_t u32Dest, uint32_t u32ByteCnts)
{
    PDMA_T *pdma = dev->DMAPort;
    uint8_t ch = dev->RxDMACh;
    __IO uint32_t *reg = &((pdma)->REQSEL0_3);

    if (ch >= PDMA_CH_MAX)
    {
        return -1;
    }

    PDMA_RESET(pdma, ch);
    /* PDMA-ch for I3C Rx */
    pdma->DSCT[ch].CTL =
        PDMA_OP_BASIC | PDMA_REQ_SINGLE |
        PDMA_SAR_FIX  | PDMA_DAR_INC |
        PDMA_WIDTH_32 |
        ((((u32ByteCnts + 3UL) / 4UL) - 1UL) << PDMA_DSCT_CTL_TXCNT_Pos);
    pdma->DSCT[ch].SA = u32Src;
    pdma->DSCT[ch].DA = u32Dest;
    /* Select peripheral for the channel */
    reg[(ch / 4UL)] = (reg[(ch / 4UL)] & ~(PDMA_REQSEL0_3_REQSRC0_Msk << ((ch % 4UL) * 8UL))) | (PDMA_I3C0_RX << ((ch % 4UL) * 8UL));
    pdma->CHCTL |= (1UL << ch);
    I3C_EnableDMA(dev->port);
    return 0;
}

/**
  * @brief  Enable I3C Tx DMA function on PDMA ch-n.
  */
int32_t I3C_ConfigTxDMA(I3C_DEVICE_T *dev, uint32_t u32Src, uint32_t u32Dest, uint32_t u32ByteCnts)
{
    PDMA_T *pdma = dev->DMAPort;
    uint8_t ch = dev->TxDMACh;
    __IO uint32_t *reg = &((pdma)->REQSEL0_3);

    if (ch >= PDMA_CH_MAX)
    {
        return -1;
    }

    PDMA_RESET(pdma, ch);
    /* PDMA-ch for I3C Tx */
    pdma->DSCT[ch].CTL =
        PDMA_OP_BASIC | PDMA_REQ_SINGLE |
        PDMA_SAR_INC  | PDMA_DAR_FIX |
        PDMA_WIDTH_32 |
        ((((u32ByteCnts + 3UL) / 4UL) - 1UL) << PDMA_DSCT_CTL_TXCNT_Pos);
    pdma->DSCT[ch].SA = u32Src;
    pdma->DSCT[ch].DA = u32Dest;
    /* Select peripheral for the channel */
    reg[(ch / 4UL)] = (reg[(ch / 4UL)] & ~(PDMA_REQSEL0_3_REQSRC0_Msk << ((ch % 4UL) * 8UL))) | (PDMA_I3C0_TX << ((ch % 4UL) * 8UL));
    pdma->CHCTL |= (1UL << ch);
    /* Set DMAEN bit 0 then 1 to load Tx data by I3C DMA */
    I3C_EnableDMA(dev->port);
    return 0;
}

/**
  * @brief  Perform Dynamic Address Assignment by ENTDAA and SETDASA CCC
  */
int32_t I3C_CtrDAA(I3C_DEVICE_T *dev)
{
    uint32_t val;
    uint32_t count;
    uint32_t index;
    I3C_DrvMsg("\n");
    /* Initialize command response value */
    dev->cmd_response = I3C_CTRRESP_INITIAL_VALUE;

    if (!((dev->ccc_code == I3C_CCC_ENTDAA) || (dev->ccc_code == I3C_CCC_SETDASA)))
    {
        return I3C_STS_INVALID_INPUT;
    }

    if (dev->ccc_code == I3C_CCC_SETDASA)
    {
        if (dev->target_index > 6U)
        {
            return I3C_STS_INVALID_INPUT;
        }

        index = dev->target_index;
        count = 1;
    }
    else
    {
        if (dev->target_count > 7U)
        {
            return I3C_STS_INVALID_INPUT;
        }

        index = dev->target_index;
        count = dev->target_count;
    }

    /* Program Address Assignment Command Data Structure */
    val = 0;
    val |= ((count << I3C_CMDQUE_DEVCOUNT_Pos)
            | (index << I3C_CMDQUE_DEVINDX_Pos)
            | (dev->tx_id << I3C_CMDQUE_TID_Pos)
            | (dev->ccc_code << I3C_CMDQUE_CMD_Pos)
            | I3C_CMDATTR_ADDR_ASSGN_CMD);
    /* Stop and Response Status on Transfer Completion */
    val |= (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk);
    I3C_DrvMsg("[CMD val: 0x%08x] - I3C_CtrDAA\n", val);
    dev->port->CMDQUE = val;
    /* Clear parameters */
    dev->is_last_cmd  = TRUE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    dev->is_DB        = FALSE;
    dev->speed_mode   = I3C_DEVI3C_SPEED_SDR0;
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Perform Write CCC Operation
  */
int32_t I3C_CtrCCCSet(I3C_DEVICE_T *dev)
{
    uint32_t val;
    const  uint32_t *p32Buf;
    I3C_DrvMsg("\n");
    /* Initialize command response value */
    dev->cmd_response = I3C_CTRRESP_INITIAL_VALUE;
    val = 0;

    /* Try to use SDAP */
    if ((dev->tx_len > 0UL) && (dev->tx_len <= I3C_SDAP_MAX_SIZE))
    {
        /* Set transfer argument params */
        switch (dev->tx_len)
        {
            case 3:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 2UL));
                val |= (dev->tx_buf[2] << I3C_CMDQUE_DATBYTE2_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 1UL));
                val |= (dev->tx_buf[1] << I3C_CMDQUE_DATBYTE1_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

