OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
            case 2:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 1UL));
                val |= (dev->tx_buf[1] << I3C_CMDQUE_DATBYTE1_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

            case 1:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

            default:
                break;
        }

        val |= I3C_CMDATTR_SHORT_DATA_ARG;
        I3C_DrvMsg("[SDAP val: 0x%08x] - I3C_CtrCCCSet\n", val);
        dev->port->CMDQUE = val;
        /* Set transfer command params */
        val = I3C_CMDQUE_SDAP_Msk;
    }
    else if (dev->tx_len > I3C_SDAP_MAX_SIZE)
    {
        volatile uint32_t i;
        p32Buf = (uint32_t *)((uint32_t)dev->tx_buf);

        /* Write bytes to tx port */
        for (i = 0UL; i < ((dev->tx_len + 3UL) / 4UL); i++)
        {
            dev->port->TXRXDAT = p32Buf[i];
        }

        /* Program transfer argument */
        val = ((dev->tx_len << I3C_CMDQUE_DATLEN_Pos) | I3C_CMDATTR_TRANSFER_ARG);
        I3C_DrvMsg("[TRANS val: 0x%08x] - I3C_CtrCCCSet\n", val);
        dev->port->CMDQUE = val;
        val = 0;
    }
    else if (dev->tx_len == 0UL)
    {
        dev->port->CMDQUE = ((0UL << I3C_CMDQUE_DATLEN_Pos) | I3C_CMDATTR_TRANSFER_ARG);
    }
    else
    {
    }

    /* Program transfer command */
    val |= (I3C_CMDQUE_CP_Msk
            | (dev->target_index << I3C_CMDQUE_DEVINDX_Pos)
            | (dev->tx_id << I3C_CMDQUE_TID_Pos)
            | (dev->ccc_code << I3C_CMDQUE_CMD_Pos)
            | I3C_CMDATTR_TRANSFER_CMD);

    if (dev->is_last_cmd)
    {
        /* Stop and Response Status on Transfer Completion */
        val |= (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk);
    }

    I3C_DrvMsg("[CMD val: 0x%08x] - I3C_CtrCCCSet\n", val);
    dev->port->CMDQUE = val;
    /* Clear parameters */
    dev->is_last_cmd  = TRUE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    dev->is_DB        = FALSE;
    dev->speed_mode   = I3C_DEVI3C_SPEED_SDR0;
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Perform Read CCC Operation
  */
int32_t I3C_CtrCCCGet(I3C_DEVICE_T *dev)
{
    uint32_t val;
    I3C_DrvMsg("\n");
    /* Initialize command response value */
    dev->cmd_response = I3C_CTRRESP_INITIAL_VALUE;
    /* Program transfer argument */
    val = ((dev->rx_len << I3C_CMDQUE_DATLEN_Pos) |
           I3C_CMDATTR_TRANSFER_ARG);

    /* Program Defining Byte Value */
    if (dev->is_DB)
    {
        val |= (dev->DB << I3C_CMDQUE_DB_Pos);
    }

    I3C_DrvMsg("[ DRV ] [ARG val: 0x%08x] - I3C_CtrCCCGet\n", val);
    dev->port->CMDQUE = val;
    /* Program transfer command */
    val = (I3C_CMDQUE_CP_Msk
           | I3C_CMDQUE_RNW_Msk
           | dev->speed_mode
           | (dev->target_index << I3C_CMDQUE_DEVINDX_Pos)
           | (dev->tx_id << I3C_CMDQUE_TID_Pos)
           | (dev->ccc_code << I3C_CMDQUE_CMD_Pos)
           | I3C_CMDATTR_TRANSFER_CMD);

    /* Program Defining Byte Present */
    if (dev->is_DB)
    {
        val |= I3C_CMDQUE_DBP_Msk;
    }

    if (dev->is_last_cmd)
    {
        /* Stop and Response Status on Transfer Completion */
        val |= (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk);
    }

    I3C_DrvMsg("[ DRV ] [CMD val: 0x%08x] - I3C_CtrCCCGet\n", val);
    dev->port->CMDQUE = val;
    /* Clear parameters */
    dev->is_last_cmd  = TRUE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    dev->is_DB        = FALSE;
    dev->speed_mode   = I3C_DEVI3C_SPEED_SDR0;
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Perform Private/HDR-DDR Write Oeration in Controller
  */
int32_t I3C_CtrWrite(I3C_DEVICE_T *dev)
{
    int32_t ret = I3C_STS_NO_ERR;
    uint32_t val;
    const uint32_t *p32Buf;
    I3C_DrvMsg("\n");
    /* Initialize command response value */
    dev->cmd_response = I3C_CTRRESP_INITIAL_VALUE;
    val = 0;

    /* Try to use SDAP */
    if ((dev->tx_len > 0UL) && (dev->tx_len <= I3C_SDAP_MAX_SIZE))
    {
        /* Set transfer argument params */
        switch (dev->tx_len)
        {
            case 3:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 2UL));
                val |= (dev->tx_buf[2] << I3C_CMDQUE_DATBYTE2_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 1UL));
                val |= (dev->tx_buf[1] << I3C_CMDQUE_DATBYTE1_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

            case 2:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 1UL));
                val |= (dev->tx_buf[1] << I3C_CMDQUE_DATBYTE1_Pos);
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

            case 1:
                val |= (1UL << (I3C_CMDQUE_BYTESTRB_Pos + 0UL));
                val |= (dev->tx_buf[0] << I3C_CMDQUE_DATBYTE0_Pos);
                break;

            default:
                break;
        }

        val |= I3C_CMDATTR_SHORT_DATA_ARG;
        I3C_DrvMsg("[ DRV ] [SDAP val: 0x%08x] - I3C_CtrWrite\n", val);
        dev->port->CMDQUE = val;
        /* Set transfer command params */
        val = I3C_CMDQUE_SDAP_Msk;
    }
    else if (dev->tx_len > I3C_SDAP_MAX_SIZE)
    {
        p32Buf = (uint32_t *)((uint32_t)dev->tx_buf);

        /* Write bytes to tx port */
        if (dev->is_DMA)
        {
            /* Use Tx PDMA */
            ret = I3C_ConfigTxDMA(dev, (uint32_t)(p32Buf), (uint32_t)(&dev->port->TXRXDAT), dev->tx_len);
        }
        else
        {
            volatile uint32_t i;

            for (i = 0UL; i < ((dev->tx_len + 3UL) / 4UL); i++)
            {
                dev->port->TXRXDAT = p32Buf[i];
            }
        }

        /* Program transfer argument */
        val = ((dev->tx_len << I3C_CMDQUE_DATLEN_Pos) | I3C_CMDATTR_TRANSFER_ARG);
        I3C_DrvMsg("[ DRV ] [TRANS val: 0x%08x] - I3C_CtrWrite\n", val);
        dev->port->CMDQUE = val;
        val = 0;
    }
    else
    {
    }

