OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
    /* Program transfer command */
    val |= (dev->speed_mode
            | (dev->target_index << I3C_CMDQUE_DEVINDX_Pos)
            | (dev->tx_id << I3C_CMDQUE_TID_Pos)
            | I3C_CMDATTR_TRANSFER_CMD);

    /* Program HDR command */
    if (dev->is_HDR_cmd)
    {
        val |= (I3C_CMDQUE_CP_Msk | (dev->ccc_code << I3C_CMDQUE_CMD_Pos));
    }

    if (dev->is_last_cmd)
    {
        /* Stop and Response Status on Transfer Completion */
        val |= (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk);
    }

    I3C_DrvMsg("[ DRV ] [CMD val: 0x%08x] - I3C_CtrWrite\n", val);
    dev->port->CMDQUE = val;
    /* Clear parameters */
    dev->is_last_cmd  = TRUE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    dev->is_DB        = FALSE;
    dev->speed_mode   = I3C_DEVI3C_SPEED_SDR0;
    return ret;
}

/**
  * @brief  Perform Private/HDR-DDR Read Oeration in Controller
  */
int32_t I3C_CtrRead(I3C_DEVICE_T *dev)
{
    int32_t ret = I3C_STS_NO_ERR;
    uint32_t val;
    I3C_DrvMsg("\n");

    if (dev->is_DMA)
    {
        /* Enable PDMA channel for I3C Rx function */
        ret = I3C_ConfigRxDMA(dev, (uint32_t)(&dev->port->TXRXDAT), (uint32_t)(dev->rx_buf), (I3C_DEVICE_RX_BUF_CNT * 4UL));
    }

    /* Initialize command response value */
    dev->cmd_response = I3C_CTRRESP_INITIAL_VALUE;
    /* Program transfer argument */
    val = ((dev->rx_len << I3C_CMDQUE_DATLEN_Pos) |
           I3C_CMDATTR_TRANSFER_ARG);
    I3C_DrvMsg("[ DRV ] [ARG val: 0x%08x] - I3C_CtrRead\n", val);
    dev->port->CMDQUE = val;
    /* Program transfer command */
    val = (I3C_CMDQUE_RNW_Msk
           | dev->speed_mode
           | (dev->target_index << I3C_CMDQUE_DEVINDX_Pos)
           | (dev->tx_id << I3C_CMDQUE_TID_Pos)
           | I3C_CMDATTR_TRANSFER_CMD);

    /* Program HDR command */
    if (dev->is_HDR_cmd)
    {
        val |= (I3C_CMDQUE_CP_Msk | (dev->HDR_cmd << I3C_CMDQUE_CMD_Pos));
    }

    if (dev->is_last_cmd)
    {
        /* Stop and Response Status on Transfer Completion */
        val |= (I3C_CMDQUE_TOC_Msk | I3C_CMDQUE_ROC_Msk);
    }

    I3C_DrvMsg("[ DRV ] [CMD val: 0x%08x] - I3C_CtrRead\n", val);
    dev->port->CMDQUE = val;
    /* Clear parameters */
    dev->is_last_cmd  = TRUE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    dev->is_DB        = FALSE;
    dev->speed_mode   = I3C_DEVI3C_SPEED_SDR0;
    return ret;
}

/**
  * @brief  Perform DEFTGTS CCC to Secondary Controller (Target)
  */
int32_t I3C_CtrDEFTGTS(I3C_DEVICE_T *dev)
{
    int32_t ret = I3C_STS_NO_ERR;
    volatile uint8_t  i;
    volatile uint32_t j = 0;
    I3C_DrvMsg("\n");
    /* DEFTGTS CCC */
    /* 1-bytes: Set valid Target counts for Secondary Controller */
    dev->tx_buf[0] = dev->target_count;
    /* 4-bytes: Set Controller's info */
    dev->tx_buf[1] = (dev->main_controller_da << 1); // DA
    dev->tx_buf[2] = ((dev->port->SLVCHAR & I3C_SLVCHAR_DCR_Msk) >> I3C_SLVCHAR_DCR_Pos); // DCR;
    dev->tx_buf[3] = (dev->port->SLVCHAR & 0xFFU); // BCR;
    dev->tx_buf[4] = 0x0; // SA

    /* N-bytes: Set valid Target's info */
    for (i = 0U; i < dev->tx_buf[0]; i++)
    {
        if (dev->ibi_id == dev->port->TGTCHAR[i].DADDR)
        {
            continue;
        }

        dev->tx_buf[(j * 4U) + 5U + 0U] = (dev->port->TGTCHAR[i].DADDR << 1U); // DA
        dev->tx_buf[(j * 4U) + 5U + 1U] = (dev->port->TGTCHAR[i].BCRDCR & 0xFFU); // DCR;
        dev->tx_buf[(j * 4U) + 5U + 2U] = ((dev->port->TGTCHAR[i].BCRDCR & 0xFF00U) >> 8U); // BCR;
        dev->tx_buf[(j * 4U) + 5U + 3U] = 0x0; // SA
        j++;
    }

    dev->target_index = 0; // for Broadcast CCC
    dev->tx_len       = (1UL + 4UL + (dev->tx_buf[0] * 4UL));
    dev->is_last_cmd  = TRUE;
    dev->ccc_code     = I3C_CCC_DEFTGTS; // Not support IRQ
    ret = I3C_CtrCCCSet(dev);

    while ((dev->port->INTSTS & I3C_INTSTS_RESPRDY_Msk) == 0UL) {}

    dev->cmd_response = dev->port->RESPQUE;
    I3C_DrvMsg("[ DRV ] DEFTGTS CCC - RespQ status 0x%08x.\n", dev->cmd_response);

    if ((dev->cmd_response & I3C_CTRRESP_ERRSTS_Msk) == I3C_CTRRESP_NO_ERR)
    {
        I3C_DrvMsg("[ DRV ] [ DEFTGTS, PASS ] (RESP: 0x%08x)\n", dev->cmd_response);
    }
    else
    {
        I3C_DrvMsg("[ DRV ] [ DEFTGTS, error code %d ] (RESP: 0x%08x)\n",
                   (uint32_t)((dev->cmd_response & I3C_CTRRESP_ERRSTS_Msk) >> I3C_CTRRESP_ERRSTS_Pos), dev->cmd_response);
        return -1;
    }

    I3C_DrvMsg("\n");
    return ret;
}

/**
  * @brief  Perform GETACCCR CCC for Active the Secondary Controller
  */
int32_t I3C_CtrGETACCCR(I3C_DEVICE_T *dev)
{
    int32_t ret = I3C_STS_NO_ERR;
    I3C_DrvMsg("\n");
    dev->rx_len       = 1;
    dev->is_last_cmd  = TRUE;
    dev->ccc_code     = I3C_CCC_GETACCCR; // Not support IRQ
    ret = I3C_CtrCCCGet(dev);

    while ((dev->port->INTSTS & I3C_INTSTS_RESPRDY_Msk) == 0UL) {}

    dev->cmd_response = dev->port->RESPQUE;
    I3C_DrvMsg("[ DRV ] GETACCCR CCC - RespQ status 0x%08x.\n", dev->cmd_response);

    if (dev->is_DMA)
    {
        /* Enable PDMA channel for I3C Rx function */
        ret = I3C_ConfigRxDMA(dev, (uint32_t)(&dev->port->TXRXDAT), (uint32_t)(dev->rx_buf), (I3C_DEVICE_RX_BUF_CNT * 4UL));
    }

    if ((dev->cmd_response & I3C_CTRRESP_ERRSTS_Msk) == I3C_CTRRESP_NO_ERR)
    {
        uint32_t *p32Buf;
        p32Buf = (uint32_t *)((uint32_t)dev->rx_buf);

        if (dev->is_DMA == 0U)
        {
            p32Buf[0] = dev->port->TXRXDAT;
        }

        if (dev->ibi_id == ((p32Buf[0] & 0xFFUL) >> 1UL))
        {
            I3C_DrvMsg("[ DRV ] [ GETACCCR result ] matched: 0x%02x.\n", dev->ibi_id);
        }
        else
        {
            I3C_DrvMsg("[ DRV ] [ GETACCCR result ] mismatch: 0x%02x, 0x%02x\n", dev->ibi_id, ((p32Buf[0] & 0xFFUL) >> 1UL));
            return -1;
        }
    }
    else
    {
        I3C_DrvMsg("[ DRV ] [ GETACCCR, error code %d ]\n", (uint32_t)((dev->cmd_response & I3C_CTRRESP_ERRSTS_Msk) >> I3C_CTRRESP_ERRSTS_Pos));
        return -1;
    }

    I3C_DrvMsg("\n");
    return ret;
}

/**
  * @brief  Get In-Band Interrupt Event in Controller
  */
int32_t I3C_CtrGetIBI(I3C_DEVICE_T *dev)
{
    if (dev->ibi_status & I3C_IBIQSTS_NACK)
    {
        I3C_DrvMsg("\n[ DRV ] NACK IBI, status 0x%08x\n", dev->ibi_status);
    }
    else
    {
        volatile uint32_t i;
        uint32_t ibi_len;
        uint32_t ibi_id;
        uint32_t RWBit = 0;
        ibi_len = ((dev->ibi_status & I3C_IBISTS_DATLEN_Msk) >> I3C_IBISTS_DATLEN_Pos);
        ibi_id  = (((dev->ibi_status & I3C_IBISTS_IBIID_Msk) >> I3C_IBISTS_IBIID_Pos) >> 1);
        RWBit   = ((dev->ibi_status >> I3C_IBISTS_IBIID_Pos) & BIT0);

        if (ibi_len == 0UL)
        {
            /* For Hot-Join request or CR operation */
            if (RWBit == BIT0)
            {
                I3C_DrvMsg("\n[ DRV ] Error Hot-Join or CR request RW bit=%d.\n", RWBit);
                return -1;
            }

