OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
            if (ibi_id == 0x2UL)
            {
                dev->ibi_type = I3C_IBI_TYPE_HJ;
                dev->ibi_id   = ibi_id;
                dev->ibi_len  = ibi_len;
            }
            else
            {
                I3C_DrvMsg("\n[ DRV ] Get Target Addr 0x%02x for CR request ...\n", ibi_id);
                dev->ibi_type = I3C_IBI_TYPE_CR;
                dev->ibi_id   = ibi_id;
                dev->ibi_len  = ibi_len;

                // accept Target CR request after Target DA matched
                if (dev->ibi_id != 0U)
                {
                    // Check if Target's DA matched and send GETACCCR CCC
                    for (i = 0UL; i < 7UL; i++)
                    {
                        if (dev->target_da[i] == dev->ibi_id)
                        {
                            break;
                        }
                    }

                    if (i >= 7UL)
                    {
                        return -3;    /* No Target's DA matched */
                    }

                    if (dev->ibi_id == dev->main_controller_da)
                    {
                        /*
                            Device Role of Main Controller will return to Controller Role from Target Role.
                            Current active Controller no need to send DEFTGTS CCC.
                        */
                        I3C_DrvMsg("\t[ DRV ] Direct return to Controller\n");
                    }
                    else
                    {
                    }

                    /* Add delay loop */
                    I3C_DelayLoop(SystemCoreClock / 500UL);

                    /* Perform GETACCCR CCC */
                    if (I3C_CtrGETACCCR(dev) != I3C_STS_NO_ERR)
                    {
                        return -5;    /* I3C_DEFTGTS error */
                    }
                }

                // monitor bus owner status
                if (dev->port->INTSTS & I3C_INTSTS_BUSOWNER_UPDATED)
                {
                    dev->port->INTSTS  = I3C_INTSTS_BUSOWNER_UPDATED;
                    dev->intsts       |= I3C_INTSTS_BUSOWNER_UPDATED;
                    dev->port->DEVCTL |= I3C_DEVCTL_RESUME_Msk;

                    while ((dev->port->DEVCTL & I3C_DEVCTL_RESUME_Msk) == I3C_DEVCTL_RESUME_Msk) {}

                    if (I3C_IS_CONTROLLER(dev->port))
                    {
                        I3C_DrvMsg("[ DRV ]I3C role change from Target to Controller\n");
                    }
                    else
                    {
                        I3C_DrvMsg("[ DRV ]I3C role change from Controller to Target\n");
                    }
                }
            }
        }
        else
        {
            uint32_t *p32Buf;
            uint32_t word_cnt;
            /* For In-Band interrupt payload */
            p32Buf = (uint32_t *)((uint32_t)dev->rx_buf);
            word_cnt = (ibi_len + 3UL) / 4UL;

            for (i = 0; i < word_cnt; i++)
            {
                p32Buf[i] = dev->port->IBIQUE;
            }

            I3C_DrvMsg("\n[ DRV ] ibi_id: 0x%02x, len: %d\n\t", ibi_id, ibi_len);

            for (i = 0; i < ibi_len; i++)
            {
                I3C_DrvMsg(" 0x%02x", dev->rx_buf[i]);
            }

            I3C_DrvMsg("\n");
            dev->ibi_type    = I3C_IBI_TYPE_TIR;
            dev->ibi_MDB     = dev->rx_buf[0];
            dev->ibi_id      = ibi_id;
            dev->ibi_len     = ibi_len - 1UL;
            dev->ibi_buf     = (uint8_t *)&dev->rx_buf[1];
            //dev->ibi_payload = p32Buf[0];
        }
    }

    return I3C_STS_NO_ERR;
}

/**
  * @brief  Parse Error Condition and Recovery in Controller
  */
void I3C_CtrHandleTransErr(I3C_DEVICE_T *dev)
{
    uint32_t    err_status;
    uint32_t    resume = FALSE;
    uint32_t    TID;
    uint32_t    LEN;
    (void)TID; // for I3C_DrvMsg
    I3C_DrvMsg("\n");
    err_status = (dev->cmd_response & I3C_CTRRESP_ERRSTS_Msk);
    TID        = (((uint32_t)dev->cmd_response & I3C_CTRRESP_TID_Msk) >> I3C_CTRRESP_TID_Pos);
    LEN        = (((uint32_t)dev->cmd_response & I3C_CTRRESP_DATLEN_Msk) >> I3C_CTRRESP_DATLEN_Pos);
    I3C_DrvMsg("[ DRV ] Controller error status 0x%08x.\n", err_status);

    switch (err_status)
    {
        case I3C_CTRRESP_CRC_ERR:
            I3C_DrvMsg("\t# Transfer Error: CRC Error occurred in the HDR-DDR or HDR-BT Read Transfer \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_PARITY_ERR:
            I3C_DrvMsg("\t# Transfer Error: Parity Error occurred in HDR Read Transfers \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_FRAME_ERR:
            I3C_DrvMsg("\t# Transfer Error: Frame Error occurred in HDR Read Transfers \n");;
            resume = TRUE;
            break;

        case I3C_CTRRESP_BRD_ADDR_NACK_ERR:
            if (dev->ibi_type == I3C_IBI_TYPE_HJ)
            {
                // set dev->target_count in I3C_CtrGetIBI()
            }
            else
            {
                I3C_DrvMsg("\t# Transfer Error: I3C Broadcast Address NACK Error \n");
                I3C_DrvMsg("\tTID %d, remaining device count %d\n", TID, LEN);

                if (dev->target_count >= LEN)
                {
                    dev->target_count = dev->target_count - LEN;
                }
            }

            resume = TRUE;
            break;

        case I3C_CTRRESP_ADDR_NACK_ERR:
            I3C_DrvMsg("\t# Transfer Error: Target Address NACK \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_FLOW_ERR:
            I3C_DrvMsg("\t# Transfer Error: Receive Buffer Overflow/Transmit Buffer Underflow in HDR Transfers \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_TRANS_ABORTED_ERR:
            I3C_DrvMsg("\t# Transfer Error: Transfer Aborted \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_WRITE_NACK_ERR:
            I3C_DrvMsg("\t# Transfer Error: I2C Target Write Data NACK Error \n");
            resume = TRUE;
            break;

        case I3C_CTRRESP_PEC_ERR:
            I3C_DrvMsg("\t# Transfer Error: PEC byte validation error occurs in read transfers \n");
            resume = TRUE;
            break;

        default:
            I3C_DrvMsg("\t# Unkown Error \n");
            resume = TRUE;
            break;
    }

    /* Reset all FIFO */
    dev->port->RSTCTL = (I3C_RSTCTL_RESPRST_Msk | I3C_RSTCTL_RXRST_Msk | I3C_RSTCTL_TXRST_Msk);

