OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
    while (dev->port->RSTCTL != 0UL) {}

    /* Resume Controller if necessary */
    if (resume)
    {
        I3C_DrvMsg("\tResuming the Controller\n\n");
        dev->port->DEVCTL |= I3C_DEVCTL_RESUME_Msk;
    }
}

static void I3C_TgtResetAndResume(I3C_DEVICE_T *dev, uint8_t ExtCmdIdx)
{
    (void)ExtCmdIdx;
    I3C_DrvMsg("\n");
    /* Reset all FIFO -> apply resume */
    dev->port->RSTCTL = (I3C_RSTCTL_RESPRST_Msk | I3C_RSTCTL_RXRST_Msk | I3C_RSTCTL_IBIQRST_Msk);

    while (dev->port->RSTCTL != 0UL) {}

    dev->port->DEVCTL |= I3C_DEVCTL_RESUME_Msk;

    while ((dev->port->DEVCTL & I3C_DEVCTL_RESUME_Msk) != 0UL) {}

    I3C_DrvMsg("[ DRV ] Target Reset and Resume Completed.\n");
}

/**
  * @brief  Get Target Response Result in Controller Write Operation
  */
int32_t I3C_TgtRecv(I3C_DEVICE_T *dev)
{
    uint8_t             u8TargetID;
    uint8_t             u8ErrSts;
    uint16_t            u16DataLen;
    volatile uint32_t   u32RespQ;
    uint32_t            *pu32RxBuf;
    (void)u8TargetID;
    I3C_DrvMsg("\n");
    dev->tgtRespQ[0].ErrSts = (uint8_t)I3C_TGTRESP_INITIAL_VALUE;

    if (!(dev->port->INTSTS & I3C_INTSTS_RESPRDY_Msk))
    {
        return I3C_STS_RESPQ_EMPTY;
    }

    pu32RxBuf = (uint32_t *)((uint32_t)dev->rx_buf);
    dev->tgtRespQ[0].RxBufAddr = (uint32_t)(&pu32RxBuf[0]);
    dev->tgtRespQ[0].RxBufLen  = 0;
    u32RespQ = dev->port->RESPQUE;
    I3C_DrvMsg("RESPQUE = 0x%08X\n", u32RespQ);
    u16DataLen  = (uint16_t)((u32RespQ & I3C_TGTRESP_DATLEN_Msk) >> I3C_TGTRESP_DATLEN_Pos);
    u8TargetID = (uint8_t)((u32RespQ & I3C_TGTRESP_TID_Msk) >> I3C_TGTRESP_TID_Pos);
    u8ErrSts   = (uint8_t)((u32RespQ & I3C_TGTRESP_ERRSTS_Msk) >> I3C_TGTRESP_ERRSTS_Pos);

    if ((int32_t)u8ErrSts != I3C_STS_NO_ERR)
    {
        I3C_DrvMsg("\tError RESPQ: 0x%08x (TID: %d) (L-%d)\n", u32RespQ, u8TargetID, __LINE__);
        return (u32RespQ & I3C_TGTRESP_ERRSTS_Msk);
    }

    dev->tgtRespQ[0].TargetID = u8TargetID;
    dev->tgtRespQ[0].ErrSts   = u8ErrSts;

    if (dev->is_DMA)
    {
        /* Use PDMA RX */
    }
    else
    {
        volatile uint32_t   i;

        for (i = 0UL; i < ((u16DataLen + 3UL) / 4UL); i++)
        {
            pu32RxBuf[i] = dev->port->TXRXDAT;
        }
    }

    I3C_DrvMsg("[ DRV ] RESPQ: 0x%08x (TID: %d) (#1)\n", u32RespQ, u8TargetID);
    dev->tgtRespQ[0].RxBufLen += u16DataLen;
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Prepare Target Transmit Command Data for Controller Read Operation
  */
int32_t I3C_TgtSend(I3C_DEVICE_T *dev)
{
    int32_t ret = I3C_STS_NO_ERR;
    uint32_t txlen     = dev->tx_len;
    const uint32_t *p32Buf;
    I3C_DrvMsg("\n");
    /* Push data to EXT CMD TX Buffer */
    p32Buf = (uint32_t *)((uint32_t)dev->tx_buf);

    if (dev->is_DMA)
    {
        /* Use Tx PDMA */
        ret = I3C_ConfigTxDMA(dev, (uint32_t)(p32Buf), (uint32_t)&dev->port->TXRXDAT, txlen);
    }
    else
    {
        volatile uint32_t i;

        for (i = 0UL; i < ((txlen + 3UL) / 4UL); i++)
        {
            dev->port->TXRXDAT = p32Buf[i];
        }
    }

    uint32_t CMDQUE     = ((0UL << I3C_CMDQUE_TID_Pos) | (txlen << I3C_CMDQUE_DATLEN_Pos));
    I3C_DrvMsg("[ DRV ] [CMD val: 0x%08X] - I3C_CtrWrite\n", CMDQUE);
    dev->port->CMDQUE = CMDQUE;
    /*
        User need to parse Extended Command Status in EXTCMD.WORD1[15:8] while EXTFINS set to 1 (EXTCMD Has Finished Status).
        Refer to I3C_TgtGetSendResult(...) API.
    */
    dev->ccc_code     = 0x0;
    dev->is_DB        = FALSE;
    dev->is_HDR_cmd   = FALSE;
    dev->is_HDRBT_cmd = FALSE;
    return ret;
}

/**
  * @brief  Get Target Extended Transmit Command Result in Controller Read Operation
  */
int32_t I3C_TgtGetSendResult(I3C_DEVICE_T *dev)
{
    (void)dev;
    I3C_DrvMsg("\n");
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Issue In-Band Interrupt Event in Target
  */
int32_t I3C_TgtIssueIBI(I3C_DEVICE_T *dev)
{
    (void)dev;
    I3C_DrvMsg("\n");

    if ((dev->port->SLVEVNTS & I3C_SLVEVNTS_SIREN_Msk) == 0UL)
    {
        I3C_DrvMsg("[ DRV ] ERROR. Target Interrupt Request NOT Enabled. \n\n");
        return I3C_STS_INVALID_INPUT;
    }

    if ((dev->port->SIR & (I3C_SIR_EN_Msk | I3C_SIR_MR_Msk)) != 0UL)
    {
        I3C_DrvMsg("[ DRV ] ERROR. SIR pending, 0x%x. \n\n", dev->port->SIR);
        return I3C_STS_INVALID_INPUT;
    }

    if (dev->target_index > 4UL)
    {
        I3C_DrvMsg("[ DRV ] ERROR. Invalid Target index, 0x%x. \n\n", dev->target_index);
        return I3C_STS_INVALID_INPUT;
    }

    switch (dev->ibi_type)
    {
        case I3C_IBI_TYPE_TIR:
            break;

        case I3C_IBI_TYPE_CR:
            if ((dev->port->SLVEVNTS & I3C_SLVEVNTS_MREN_Msk) == 0UL)
            {
                I3C_DrvMsg("[ DRV ] ERROR. Controller Request NOT Enabled.\n\n");
                return I3C_STS_INVALID_INPUT;
            }

            /* Support "ACK GETACCCR CCC" */
            dev->port->DEVCTLE &= ~(I3C_DEVCTLE_MRACKCTL_Msk);
            /* Trigger MR request */
            dev->port->SIR |= I3C_SIR_MR_Msk;
            /* Bus Owner Updated event in Target's IRQ Handler */
            /* The Controller sends GETACCCR CCC (Get Accept Controller Role) while received Controller request from Target */
            return I3C_STS_NO_ERR;
            break;

        default:
            return I3C_STS_INVALID_INPUT;
            break;
    }

    /* Check if payload length > 4-bytes */
    if (dev->ibi_len > 4U)
    {
        return I3C_STS_INVALID_INPUT;
    }

    /* Program IBI payload data, payload length and MDB */
    dev->port->SIR    = (((dev->ibi_len & 0xFFUL) << I3C_SIR_DATLEN_Pos) | ((dev->ibi_MDB & 0xFFUL) << I3C_SIR_MDB_Pos) | (0U << I3C_SIR_CTL_Pos));
    dev->port->SIRDAT = dev->ibi_payload;
    /* Trigger IBI request */
    /* SIR EN bit be cleared automatically after the Controller accepts the IBI request or Target unable to issue the IBI request */
    dev->port->SIR |= I3C_SIR_EN_Msk;
    return I3C_STS_NO_ERR;
}

/**
  * @brief  Parse Error Condition and Recovery in Target
  */
void I3C_TgtHandleTransErr(I3C_DEVICE_T *dev)
{
    uint32_t dev_status;
    uint32_t err_status;
    I3C_DrvMsg("\n");
    dev_status = dev->port->CCCDEVS;
    I3C_DrvMsg("[ DRV ] Target device status 0x%08x.\n", dev_status);

    if (dev_status)
    {
        uint32_t resume = FALSE;

        if (dev_status & I3C_CCCDEVS_SLVBUSY_Msk)
        {
            I3C_DrvMsg("\t#Target busy status\n");
            resume = TRUE;
        }

        if (dev_status & I3C_CCCDEVS_FRAMEERR_Msk)
        {
            I3C_DrvMsg("\t# Dev frame error\n");
        }

        if (dev_status & I3C_CCCDEVS_BFNAVAIL_Msk)
        {
            I3C_DrvMsg("\t# Dev buffer not available\n");
        }

        if (dev_status & I3C_CCCDEVS_DATNRDY_Msk)
        {
            I3C_DrvMsg("\t# Dev data not ready\n");
        }

        if (dev_status & I3C_CCCDEVS_OVFERR_Msk)
        {
            I3C_DrvMsg("\t# Dev overflow error\n");
        }

        if (dev_status & I3C_CCCDEVS_UDFERR_Msk)
        {
            I3C_DrvMsg("\t# Dev underflow error\n");
        }

        if (dev_status & I3C_CCCDEVS_PROTERR_Msk)
        {
            I3C_DrvMsg("\t# Dev protocol error\n");
        }

        I3C_DrvMsg("\t# Activity Mode:[0x%x] / Pending Interrupt:[0x%x]",
                   (uint32_t)((dev_status & I3C_CCCDEVS_ACTMODE_Msk) >> I3C_CCCDEVS_ACTMODE_Pos),
                   (uint32_t)((dev_status & I3C_CCCDEVS_PENDINT_Msk) >> I3C_CCCDEVS_PENDINT_Pos));

