OpenNuvoton/M55M1BSP/Library/StdDriver/src/i3c.c
        /* Resume Target if necessary */
        if (resume)
        {
            I3C_DrvMsg("\tResuming the Target\n\n");
            dev->port->DEVCTL |= I3C_DEVCTL_RESUME_Msk;
        }
    }

    err_status = dev->tgtRespQ[0].ErrSts;
    I3C_DrvMsg("[ DRV ] Target response error status 0x%08x.\n", err_status);

    switch (err_status)
    {
        case I3C_TGTRESP_CRC_ERR:
            I3C_DrvMsg("\t# Transfer Error: CRC Error (Controller write in DDR mode) \n");
            break;

        case I3C_TGTRESP_PARITY_ERR:
            I3C_DrvMsg("\t# Transfer Error: Parity Error (Controller write in both DDR and SDR mode) \n");
            break;

        case I3C_TGTRESP_FRAME_ERR:
            I3C_DrvMsg("\t# Transfer Error: Frame Error (Controller write in HDR mode) \n");;
            break;

        case I3C_TGTRESP_FLOW_ERR:
            I3C_DrvMsg("\t# Transfer Error: Underflow/Overflow Error \n");
            break;

        case I3C_TGTRESP_CONTROLLER_TERMINATE_ERR:
            I3C_DrvMsg("\t# Transfer Error: Controller early terminal Error \n");
            break;

        default:
            I3C_DrvMsg("\t# Unkown Error \n");
            break;
    }

    I3C_DrvMsg("\n");
}

/**
  * @brief  Handle Target Interrupt Status
  */
void I3C_TgtHandleIntSts(I3C_DEVICE_T *dev)
{
    I3C_DrvMsg("\n");

    if (dev->intsts & I3C_INTSTS_DA_ASSIGNED)
    {
        /* Main Target Address */
        if (dev->port->DEVADDR & I3C_DEVADDR_DAVALID_Msk)
        {
            I3C_DrvMsg("[ DRV ] Set to I3C mode, DA: 0x%02x.\n", (uint8_t)((dev->port->DEVADDR & I3C_DEVADDR_DA_Msk) >> I3C_DEVADDR_DA_Pos));
            dev->target_da[0] = (uint8_t)((dev->port->DEVADDR & I3C_DEVADDR_DA_Msk) >> I3C_DEVADDR_DA_Pos);
        }
        else
        {
            I3C_DrvMsg("[ DRV ] Set to I2C mode, SA: 0x%02x.\n", (uint8_t)((dev->port->DEVADDR & I3C_DEVADDR_SA_Msk) >> I3C_DEVADDR_SA_Pos));
            dev->target_da[0] = 0x0;
            dev->target_sa[0] = (uint8_t)((dev->port->DEVADDR & I3C_DEVADDR_SA_Msk) >> I3C_DEVADDR_SA_Pos);
        }
    }

    if (dev->intsts & I3C_INTSTS_CCC_UPDATED)
    {
        if (dev->port->SLVEVNTS & I3C_SLVEVNTS_MWLUPD_Msk)
        {
            dev->port->SLVEVNTS = I3C_SLVEVNTS_MWLUPD_Msk;
            I3C_DrvMsg("[ DRV ] Updated MWL to 0x%x.\n", (uint32_t)((dev->port->SLVMXLEN & I3C_SLVMXLEN_MWL_Msk) >> I3C_SLVMXLEN_MWL_Pos));
        }
        else if (dev->port->SLVEVNTS & I3C_SLVEVNTS_MRLUPD_Msk)
        {
            dev->port->SLVEVNTS = I3C_SLVEVNTS_MRLUPD_Msk;
            I3C_DrvMsg("[ DRV ] Updated MRL to 0x%x.\n",
                       (uint32_t)((dev->port->SLVMXLEN & I3C_SLVMXLEN_MRL_Msk) >> I3C_SLVMXLEN_MRL_Pos));
            I3C_TgtResetAndResume(dev, 0xFF);
        }
        else
        {
            I3C_DrvMsg("[ DRV ] Updated - ENTAS%d.\n", (uint32_t)((dev->port->SLVEVNTS & I3C_SLVEVNTS_ACTSTATE_Msk) >> I3C_SLVEVNTS_ACTSTATE_Pos));
            I3C_DrvMsg("[ DRV ] Updated - HJEN %d.\n", (uint32_t)((dev->port->SLVEVNTS & I3C_SLVEVNTS_HJEN_Msk) >> I3C_SLVEVNTS_HJEN_Pos));
            I3C_DrvMsg("[ DRV ] Updated - SIREN %d.\n", (uint32_t)((dev->port->SLVEVNTS & I3C_SLVEVNTS_SIREN_Msk) >> I3C_SLVEVNTS_SIREN_Pos));
        }
    }

    I3C_DrvMsg("\n");
}

/** @} end of group I3C_EXPORTED_FUNCTIONS */
/** @} end of group I3C_Driver */
/** @} end of group Standard_Driver */
